SigninLogs
| where TimeGenerated >= ago(30d)
| make-series dLogCount = count() on TimeGenerated in range(startofday(ago(30d)),now(), 1d)
by AppDisplayName
| extend (RSquare,Slope,Variance,RVariance,Interception,LineFit)=series_fit_line(dLogCount)
| where Slope >0.2
